[
    {
        "id":1,
        "component":"RF-Receiver Coil",
        "maintenanceDesc":"Recalibration or Tuning to be performed on RF-Reciever Coil within 5 Days",
        "maintenanceDays":5,
        "maintenanceReccomend":"The specific steps for radio frequency (RF) receiver coil recalibration and tuning in an MRI system involves the following steps:<div class=\"pm-highlight-steps\"><h3>1. System Preparation:</h3><ol><li><strong>Power on the MRI system:</strong> Ensure the system is in a stable operating state.</li><li><strong>Select the desired coil:</strong> Choose the specific receiver coil you want to calibrate and tune.</li><li><strong>Place a phantom in the scanner:</strong> Phantoms are objects with known properties that mimic human tissue. They are used to ensure the system is functioning correctly.</li></ol><h3>2. Software Calibration:</h3><ol><li><strong>Access the service or calibration mode:</strong> This may require a special code or authorization from the manufacturer.</li><li><strong>Locate the RF coil calibration menu:</strong> Navigate through the system menus to find the specific option for calibrating the receiver coil.</li><li><strong>Perform calibration routines:</strong> The system will guide you through automated routines to calibrate parameters like the coil's center frequency and sensitivity. This may involve transmitting and receiving RF signals at various frequencies.</li></ol><h3>3. Manual Tuning (Optional):</h3><ol><li><strong>Monitor signal strength:</strong> The system will display the signal strength received from the phantom.</li><li><strong>Adjust tuning controls:</strong> Some systems may allow manual adjustments to fine-tune the coil's resonance frequency for optimal signal reception. This is typically done using software sliders or knobs.</li></ol><h3>4. Data Analysis and Acceptance:</h3><ol><li><strong>Review calibration results:</strong> The system will provide data on the coil's performance after calibration.</li><li><strong>Compare results to acceptance criteria:</strong> validate the results with acceptable ranges for various parameters like signal-to-noise ratio (SNR).</li><li><strong>Repeat if necessary:</strong> If the results fall outside the acceptable range, the calibration may need to be repeated or the coil may require further service.</li></ol></div><h3>Safety Precautions:</h3><ul><li><strong>Manufacturer's instructions:</strong> Always refer to the specific instructions provided by the MRI system manufacturer for proper calibration and tuning procedures, in case you need any additional support.</li><li><strong>Qualified personnel:</strong> Only qualified personnel trained on the specific MRI system should perform these procedures.</li><li><strong>Safety protocols:</strong> Follow all safety protocols established for operating the MRI system, including those related to patient safety and electromagnetic radiation.</li></ul><h3>Additional Notes:</h3><ul><li>The MRI system software may have automated calibration routines that can be performed periodically to ensure optimal performance.</li><li>Some advanced MRI systems may have self-calibration capabilities for receiver coils.</li></ul>"
    },
    {
        "id":2,
        "component":"Shim Coils",
        "maintenanceDesc":"Recalibration or Tuning to be performed on Shim Coils within 7 Days",
        "maintenanceDays":7,
        "maintenanceReccomend":"<div><p>Shim coil recalibration and tuning are critical steps in MRI (Magnetic Resonance Imaging) to achieve a homogenous magnetic field within the scanner. This homogenous field is essential for acquiring high-quality images. Here's a general overview of the process:</p><h3>Preparation:</h3><ul><li><strong>Safety:</strong> MRI systems require strict safety protocols. Ensure proper authorization and training before performing any maintenance procedures.</li><li><strong>System Checks:</strong> Before starting the shim process, verify the system is operational and there are no warnings or errors.</li></ul><h3>Shim Calibration:</h3><ul><li><strong>Reference Scan:</strong> Acquire a reference scan (often a field map) to visualize the inhomogeneity within the magnet.</li><li><strong>Automated Algorithms:</strong> Most MRI systems have built-in automated shimming routines. These algorithms adjust shim coil currents based on the reference scan data to achieve optimal field uniformity.</li><li><strong>Manual Adjustments (Optional):</strong> In some cases, manual adjustments to individual shim coil currents may be necessary for fine-tuning. This typically requires specialized training and experience.</li></ul><h3>Shim Tuning:</h3><ul><li><strong>Evaluation:</strong> Once the shim currents are set, acquire another scan to evaluate the field homogeneity. This is an iterative process, and you may need to repeat steps 1 and 2 for further refinement.</li><li><strong>Shimming Criteria:</strong> The specific criteria for acceptable field homogeneity will vary depending on the MRI system and the type of scan being performed.</li></ul><h3>Additional Points:</h3><ul><li>The frequency of shim calibration and tuning can vary depending on factors like magnet stability, usage patterns, and field drift.</li><li>Certain events, like patient movement or system restarts, may necessitate re-shimming.</li><li>Modern MRI systems often have features to monitor field stability and may prompt automatic shimming if needed.</li></ul><p><strong>Important Note:</strong> Shim coil calibration and tuning are complex procedures and should only be performed by qualified personnel with proper training and authorization. Refer to the manufacturer's service manual for detailed instructions specific to your MRI system.</p></div>"
    }
]